app/controllers/auths_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def authenticate_user
		unless User.find_by(id: session[:user_id])