app/controllers/password_resets_controller.rb

	def edit
  		@user = User.find_by_password_reset_token!(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT $2  [["password_reset_token", "o-N4JdF4Kqyg6bKji9OxAQ"], ["LIMIT", 1]]