app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ads@sfgndf"], ["LIMIT", 1]]
---
	def create
		user = User.find_by(email:login_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def destroy
    	User.find(session[:user_id])